{"anchor_text": "The film takes place in Burma and India during World War II.\nA British officer falls in love with his Japanese instructor at a military language school. They start a romance, but she is regarded as the enemy and is not accepted by his countrymen. They marry in secret and plan on spending his two weeks' leave together. When one of the other officers is injured, he is sent into the field as an interrogator. Later he is captured by the Japanese army when he is patrolling with a brigadier and an Indian driver in a Japanese-controlled zone. He escapes and returns to his own lines, only to discover that his wife is suffering from a brain tumour. Although the doctor initially gives her good odds of surviving, she dies after an operation.", "text_a": "During the Irish War of Independence in 1921, Irish rebel leader Dennis Riordan (Aherne) and English aristocrat Helen Drummond (Oberon) meet and fall in love. Riordan is pursued, however, by British army officer Captain Preston (Niven).\nThe original film ended with Riordan getting shot and killed, but did not do well at the box office. A happier ending was also filmed which has Riordan being shot but surviving; all subsequent versions have. The original cut has since been lost.\nThe movie has several comic relief scenes: after a raid on an IRA \"safe house\", British officers grumble about being not being able to find Riordan, who is in fact standing just behind them; when the Irish Delegation goes to a formal ball and is asked by the footman for their names to be announced, the delegation replies in Irish.", "text_b": "1914, German advance through Belgium: the young war volunteer Alexander 'Alex' Haller (Schell) is given water by an equally young Belgian woman (Berger). \n1917, Third Battle of Flanders: Alex, now a 2nd lieutenant, is tired about the propaganda at the Home Front, so he spends his furlough in the hinterland of the Western Front. \nWhile boarding in a brothel, he meets the young woman again. They fall in love. \nLate 1918, German retreat after the Armistice: Engele and Alex meet again only to be harassed by a Belgian mob. Shortly prior to be hanged by the mob, a group of passing Belgian soldiers, tired about killing, saves them. End of the tale.", "text_a_is_closer": false}
{"anchor_text": "The foursome (Gérard Rinaldi, Jean Sarrus, Gérard Filipelli, Jean-Guy Fechner) are on a holiday. The Little Olympic flame is to be passed through their village. A grocer (Paul Préboist) calls upon them for help in decorating the village. On their job Gérard falls for the grocer's daughter Délice (Martine Kelly). However she runs away with the sportsman with the flame. The four then enter the Little Olympics to try to win her back and cause havoc in the process.", "text_a": "The old grandmother Tina arrives in town to attend the wedding of his nephew Alberto with his girlfriend Ileana.\nUpon arrival she discovers that she has been stolen of a medallion that her late husband had given her.\nHe goes to the police station to file a complaint and get the dear object back, but given the length of the investigation, he decides to carry out the search for the thief himself, combining a great deal of mess.\nEventually, by chance, he finds the thief, who lives in the same hotel, also managing to have an entire gang of criminals arrested.\nThe grandson Alberto can marry the beautiful Ileana and the grandmother Tina will be appointed, by merit, an honorary colonel of the female police.", "text_b": "Brendan Byers III is a rich playboy who enlists to fight in the war against the Axis powers, but is classified 4-F.  He really wants to fight, so he enlists other 4-Fs and some loyal volunteers from his own service staff and forms his own army, financing their training and equipment. Once completed, they travel to the front in Italy, with Byers impersonating a Nazi general named Eric Kesselring.\nThe plan is to pull back the German lines, since the front has remained static for too long, enabling the Allies to push forward again. The mission does not go smoothly and they must overcome several obstacles, including the fiery wife of the local mayor who is the real Kesselring's lover, and the real Kesselring's involvement in an assassination attempt on Hitler.  Afterwards, they face their next mission: infiltrating the Imperial Japanese command to influence the outcome of the Battle of Kwajalein.", "text_a_is_closer": true}
{"anchor_text": "Anna (Gry Bay) is a single woman who seeks to maintain an active sex life while staying clear of emotional involvement, after having been jilted by the love of her life, Johan (Mark Stevens). She has a relationship with Frank (Thomas Raft), but refuses to let him move in with her. When Johan shows up again after five years absence, she starts wondering how much longer she can maintain her emotional independence, and if that is what she wants. She has sex with him, loses his telephone number and cannot contact him. She ends her affair with Frank and when she is offered a job as costume designer in a French theatre, she decides to move to Paris. She leaves her flat to her flatmate Camilla (Eileen Daly) who asks her permission to rent out the now empty room to a friend of hers. This friend turns out to be Johan, and Anna meets him as she leaves for Paris, where the local stage actors Pierre (Morten Schelbech) and Sophie (Ovidie) offer new amorous temptations, but she worries about Johan finding a new love. In the end she returns to Copenhagen and, after mistakenly thinking that Johan has been unfaithful to her, she faces her fears of commitment and is reunited with him.", "text_a": "A psychological portrait of relationships and sexual desire. Diana and her husband Julian have been together for some time. Despite Diana's insecurity, she agrees to experiment with another couple sexually for the first time. They post an advertisement on the internet, to which Alex and Timo respond. Diana and Julian invite the other couple over to Diana's parents' ultra-modern house (the parents are absent) for a weekend.\nAlex and Timo are confident swingers, especially gorgeous Alex, whose ravishing sexiness and confident sexuality intimidates quiet Diana, about whom it is hinted that the house holds unhappy childhood memories. However, Timo seems strangely uninterested. But once night falls and their sexual exploration begins the relationships are put to the test.", "text_b": "The story of this film starts with the difficulties of a woman's life after the abandonment of her husband. The Scott family's wife, Barbara (Kay Parker), decides to face life after being abandoned by her husband Chris and the father of her son Paul (Mike Ranger), beginning to look for work without much fortune. Seeing her sad and without company, her friend Gina (Juliet Anderson) gets her a date with a friend, who takes her to a swingers party.\nOn the other hand, her son Paul with his girlfriend Sherry (Dorothy LeMay) shows a sex addiction and on the eve of his mother's date, Paul begins to have incestuous desires after seeing his mother naked.\nBarbara's date was a failure, however the images provoked in her an unthinkable lust for her own son Paul. Regretful and not knowing what to do, Barbara takes refuge affectionately in an old friend, Jerry, who in addition to company and affection gave her a job.\nThe story shows that Barbara achieved her work and emotional goals, without completely closing her chapter of passion between Paul and her.", "text_a_is_closer": true}
{"anchor_text": "A stevedore in Thessaloniki, Greece, Salamo Arouch's passion is boxing. Captured along with his family and fiancée Allegra in 1943 and interned in Auschwitz, Arouch is used by his SS captors as entertainment, forced to box against fellow prisoners. He knows that if he refuses, his family will be punished; if he wins, he will be given extra rations which he can share with them; if he loses, he will be sent to the gas chamber. As his family and friends die around him, he has only his love of Allegra and his grim determination to keep her alive.\nThe film follows the early life story of Salamo Arouch, though it takes some artistic liberties including the early introduction of wife Allegra (a pseudonym for Marta Yechiel), whom Arouch did not actually meet until after the liberation of the camp.", "text_a": "The story takes place in Berlin in 1940, where Otto Quangel is a toolmaker at a factory. His wife, Anna, is a homemaker. Though their son is fighting on the front, they are apolitical and Otto is not a member of any political party. Otto and Anna learn that their son has fallen \"like a hero\" in France and are devastated. In addition, a Jewish neighbor meets a violent death. In his grief and horror, Otto becomes politicized and decides to take action against the Nazis, hoping to foment a mass rebellion against Hitler. Though nothing comes of their efforts, the Quangels remain proud of what they've done; it enabled them to retain their faith in humanity. They are arrested, separated, tried, sentenced and executed.", "text_b": "During the World War II, in the 1930s to 1940s, Anne Frank (Lea van Acken) gets a diary as a present for her 13th birthday. When the Nazis occupy the Netherlands, she goes into hiding with her family and other Jews in Amsterdam. During that time she writes down all her thoughts about the situation in her diary. Later the Jews are betrayed and brought to concentration camps.", "text_a_is_closer": true}
{"anchor_text": "A teenage girl accuses her primary schoolteacher, Jean Doucet (Jacques Brel), of trying to rape her. The police and the mayor investigate, but Doucet denies the charges. Two other students come forward to reveal more of Doucet's misconduct – one confessing to be his mistress. Doucet faces trial and hard labour if convicted.", "text_a": "Art Brooks and Kelly Moore are a couple who get married. But Kelly realizes that Art is an alcoholic, and he beats her. She starts a relationship with the lawyer Richard Linsky. Art is then found dead, with Richard being convicted and imprisoned.", "text_b": "Tonino is a high school student, in love with the new teacher of letters, Mrs. Moretti. One day Tonino and the teacher are kidnapped and locked up in a trullo where they consummate their love. Later, Moretti is transferred to Rome, and a new and beautiful teacher is assigned to Toninos class.", "text_a_is_closer": false}
{"anchor_text": "The film is a reconstruction of the story of the salvage of the British tanker, MV San Demetrio. Carrying a cargo of oil home from Galveston, Texas, she was abandoned by her crew having been set on fire by shells from the German cruiser Admiral Scheer. Of the three lifeboats which escaped the damaged tanker, two were picked up by other ships. After drifting for three days, the occupants of the third, who included the chief engineer and the second officer, reboarded the burning San Demetrio, extinguished the fires, and, having managed to restart the engines, returned to Britain, sailing into the Clyde ten days later.", "text_a": "A pirate ship, involved in 1588 battles on the side of the Spanish Armada, suffers extensive damage and must put into a village on the British coast for repairs.\nThe village is small and isolated.  The Spanish convince the villagers that the English fleet has been defeated and that they, the Spanish, are now their masters. This results in the villagers' sullen cooperation, but rumours and unrest begin to spread and soon the Spanish pirates find themselves facing a revolt.", "text_b": "In 1943, Adolf Hitler orders the final destruction of the Yugoslav Partisans. This forces them and thousands of refugees to begin a trek northward through the Bosnian Mountains. Their goal is to reach the bridge at Neretva in order to escape. Their trip is fraught with danger every step of the way and they have to face German tanks, Italian infantry, Chetnik Cavalry, strafing airplanes, disease and natural elements.", "text_a_is_closer": true}
{"anchor_text": "Ruby Weaver is weary of her long history of failed relationships with men when she meets Sam Deed in a park. But after the two fall in love, Ruby becomes suspicious of Sam's past, his obsession with a \"Chrystie Delancey\", and \"causal effect\". Under pressure from her, he finally explains that he is really from the year 2470 and is what he calls a \"back traveler\". Ruby initially ignores this story, but after Sam's persistence, she begins to wonder. She takes him to see her therapist Meg Ford. Ruby becomes worried as to Sam's sanity when he reveals that everything he has done was a deliberate attempt to change her life. In the end, both Deed and Ford turn out to be time travelers and the fatal accident that would have killed Ruby is avoided.", "text_a": "In the 1860s a widow runs an estate, close to the Italian border. One day a former army officer arrives on his way to Italy. She persuades him to stay and work for her, and before long they begin a relationship. However, complications ensue when her daughter returns home from boarding school and develops an attachment to her mother's lover.", "text_b": "In 1943, the US Navy ship USS Eldridge disappears, due to the Philadelphia Experiment.  In the present day (2012), researchers try to recreate the experiment, which has the unintended consequence of making the Eldridge reappear, apparently having traveled through time.  The sole survivor of the original experiment is aboard, and meets up with his now-adult granddaughter.  The Eldridge continues to drift through time and space, trapping others aboard it.  The research company attempts to cover up the incident by trying to kill everyone involved.  A struggle ensues as others try to protect the survivors, and return them to their original times and places.", "text_a_is_closer": false}
{"anchor_text": "Completely broke, the three friends Willy, Kurt and Hans strand on a country road when they run out of fuel. They sell their car to acquire a nearby filling station. Taking turns at serving as petrol attendants the three independently of one another fall in love with the handsome and well-off customer Lilian, anxiously hiding their romance with each other. However, the young women only reciprocates Willy's feelings and invites him and his friends to a luxury restaurant in order to establish clarity. When Willy learns about his luck, he immediately renunciates his victory out of deference to his friends.\nTo establish close ties, Lilian asks her father to found a petrol company and to employ Willy as managing-director. The young man attaches his consent to the recruitment of his friends. When Lilian proceeds to become his secretary, infuriated Willy dictates his dismissal notice which he promptly signs without further reading – and realises that in fact he has subscribed a marriage contract with Lilian.", "text_a": "Three sisters living in Switzerland hear their father is going to marry a younger woman in New York. They travel there to stop it.\nTheir plan involves getting a man to seduce her father's fiancée. They accidentally hire a genuinely rich man who falls for one of the sisters.", "text_b": "Harry England, a British car salesman on a trip to France, meets a Baroness, \"Dany\", when her Rolls-Royce breaks down. They spend a few days together and become lovers before she disappears one night, but Harry does not know her surname.\nThe Baron then hires Harry to teach his teenage son about cars on their country estate. Harry encounters the Baroness again and their affair continues. Harry falls in love and asks the Baroness to leave the Baron, who has taken up with a lady of his own.", "text_a_is_closer": true}
{"anchor_text": "The construction of a dam in Sicily triggers unspeakable interests and appetites that find immediate repercussions in a feud between two mafia gangs who support two different power groups, one headed by the manufacturer Barresi, who aspires to secure the contract for the works, the other to the engineer Crupi, a wealthy landowner, who would lose his citrus groves following the completion of the project. After a long series of crimes of which not only some members of the rival gangs are the victims, but also many innocent ones, we arrive at the trial that sees the accused representatives of major and minor prominent members of the two mafia organizations. Of the only two defendants determined to confess, one commits suicide in prison, the other is passed off as insane. Thus, only two minor figures pay for all the others, who instead are acquitted.", "text_a": "Paul Exben is a remarkable success story: a partner in one of Paris's most prestigious law firms, boasting a substantial salary, a spacious home, a glamorous wife, and two sons who could easily grace the pages of a high-end fashion catalog. However, his world shatters when he uncovers his wife Sarah's affair with Greg Kremer, a local photographer. In a moment of passionate fury, Paul commits a fatal mistake. As he stands over the lifeless body of his wife's lover, Paul comprehends that his once-perfect life is irreversibly shattered.\nBut rather than succumb to his grim circumstances, Paul decides to seize a radical opportunity. Assuming the identity of the deceased man, he escapes to a remote region in former Yugoslavia, nestled along the enchanting Adriatic coast. In this secluded refuge, Paul is granted a second chance at being true to himself and, finally, gaining a profound perspective on the grand tapestry of life.", "text_b": "In the 1860s a widow runs an estate, close to the Italian border. One day a former army officer arrives on his way to Italy. She persuades him to stay and work for her, and before long they begin a relationship. However, complications ensue when her daughter returns home from boarding school and develops an attachment to her mother's lover.", "text_a_is_closer": true}
{"anchor_text": "In an artist’s studio, rich Parisian art dealer Félicien Mézeray sees the old soldier Legrain, whose back has a tattoo by Modigliani. This he sells unseen to two American dealers and the rest of the film revolves around his efforts to literally get the skin off Legrain’s back. The price Legrain wants is the restoration of his old family home in the country, which turns out to be the huge crumbling castle of Paluel in remote Périgord, while he turns out to be the last and extremely eccentric Count of Montignac.\nThe plot bears a very strong resemblance to Saki's short story The Background.", "text_a": "Papa Gimplewart (Davidson) exchanges his house, in order to escape the antics of inmates of the lunatic asylum next door, including characters played by Laurel and Hardy. Unfortunately, the new house turns out to be 'Jerry-built', put up in two days. After several disasters occur, Papa Gimplewart asks \"Is there anything else can happen?\". He then realizes that the inmates from the asylum have just moved in next door.\nAmong the disasters are a mop removing the color from the kitchen floor;dirty bath water leaking down from upstairs and into the communal coffeepot;and a piano sliding on an uneven floor that crashes through a wall and demolishes the family car.\nExcerpts from this film appeared in the Robert Youngson documentary LAUREL AND HARDY'S LAUGHING 20's(1965)", "text_b": "1940 The Great Depression is over and World War II had just begun. King of the con men Fargo Gondorff is released from prison and reassembles his cronies for another con, out to avenge the murder of his lifelong pal and fellow con artist Kid Colors who was kidnapped, beaten, and then shot.\nGondorff's young protege Jake Hooker attempts to pull a scam on wealthy \"Countess Veronique,\" who instead pulls one on him and turns out to be a grifter herself named Veronica.\nComing up with a boxing con, Gondorff's goal is to sting both Lonnegan, the notorious banker and gangster who wants revenge from a previous con, and Gus Macalinski, a wealthy local racketeer. One or both of them is behind Kid Colors' death.\nHooker pretends to be a boxer who is about to throw a big fight. Macalinski is not only hoodwinked into losing hundreds of thousands of dollars, but he is also talked into changing his original wager by Lonnegan. While one gangster takes care of the other, Gondorff and Hooker head for the train station with a bag full of money, tickets out of town and a final twist from Veronica.", "text_a_is_closer": false}
{"anchor_text": "The narrator meets an old Roma traveller Makar Chudra and has a conversation with him outside the camp, revolving mostly around the theme of freedom. Noticing his guest's interest in his daughter Nonka's singing, Makar warns him against falling victim to female charms and relates a story of a strong, handsome and fearless man Loiko Zobar and Radda, the latter's beauty matched only by her fierce sense of independence. Radda, well aware of her power over Loiko, orders him to kneel before her, in the presence of other men. His spirits crushed, he promises to do so the next day. Which he does, but only after putting his knife through the heart of his beloved one, to be promptly killed by Danilo, Radda's father.\nThe story ends with the narrator having a vision: bleeding Radda walking through the skies, and Loiko behind, never able to catch up with her.", "text_a": "British newlywed Regina Lambert lives in Paris with her husband Charles.  She returns home following a short vacation, determined to divorce Charles only to discover their apartment has been stripped bare and that her husband has been murdered. The French police are in her apartment.  Charles had liquidated their possessions for $1.8M and the money is missing.\nRegina is soon reunited with a mysterious stranger Joshua (Mark Wahlberg) she met on her holiday. He helps her piece together the truth about the deceased Charlie and deal with three menacing people who are now following her.", "text_b": "In the vein of CONAN THE BARBARIAN and Lucio Fulci's CONQUEST comes a tale of mythology and magic, of how THOR, a legendary god, triumphs over overwhelming odds to great victory and the destruction of his foes. After both his parents are brutally murdered by his father's rival Gnut and his men the new born Thor is placed in hiding by the physical embodiment of the god Teisha. Raised in secret under the guidance of Teisha, Thor comes to maturity and goes on a quest to avenge the death of his parents and return peace to his lands, in the process he discovers a woman to take as his wife. Taking the beautiful warrior virgin, Ina, as his companion, his exploits lead to a confrontation with Gnut, the slayer of his father. He finds and uncovers his father's sword and masters the art of combat, all under the ever watchful eye of the amorphous Teisha. How can Thor overcome Gnut and his horde? Watch the story of Thor, The Conqueror, to this day recalled in legend and in rock drawings!", "text_a_is_closer": false}
{"anchor_text": "In 1711 Usbek leaves his seraglio in Isfahan to make the long journey to France, accompanied by his young friend Rica. He leaves behind five wives (Zashi, Zéphis, Fatmé, Zélis, and Roxane) in the care of a number of black eunuchs, one of whom is the head or first eunuch. During the trip and their long stay in Paris (1712 to 1720), they comment, in letters exchanged with friends and mullahs, on numerous aspects of Western, Christian society, particularly French politics and manners, including a biting satire of the System of John Law. Over time, various disorders surface back in the seraglio, and, beginning in 1717 (Letter 139 [147]), that situation rapidly unravels. Usbek orders his head eunuch to crack down, but his message does not arrive in time, and the internal revolt brings about the death of his wives, including the vengeful suicide of his favorite, Roxane, and, it appears, most of the eunuchs.\nThe Chronology can be summarized as follows:", "text_a": "Three sisters living in Switzerland hear their father is going to marry a younger woman in New York. They travel there to stop it.\nTheir plan involves getting a man to seduce her father's fiancée. They accidentally hire a genuinely rich man who falls for one of the sisters.", "text_b": "A young workman from Tuttlingen (then part of the Duchy of Württemberg) visited the cosmopolitan city of Amsterdam for the first time in his life and was impressed by a particularly stately home and a large ship laden with precious commodities.  He innocently asked people about the owners of the house and the boat and both times the answer was \"Kannitverstan\", which means \"I can not understand you\". The simple-minded workman, however, believed that it was the name of a man called \"Kannitverstan\", and was impressed by the supposed Mr. Kannitverstan's wealth, and at the same time felt victimized in the face of his own poverty. Later in the day, he observed a funeral procession and asked one of the mourners who the deceased was. When he received the answer \"Kannitverstan\" he mourned for the late Mr. Kannitverstan, but at the same time felt very light-hearted, because he realized that death knows no social differences and everything in life is fleeting. Thus, the workman suffered his own poverty much better.", "text_a_is_closer": false}
{"anchor_text": "The Italian mountaineer Jean-Antoine Carrel wants to be the first man to reach the summit of the Matterhorn. He meets the British mountaineer Whymper and they decide to climb together. But due to an intrigue this agreement is dropped and the two men try it on the same day with two different teams, Carrel on the Italian side and Whymper on the Swiss side. The latter will successfully reach the summit along with his six companions, Hudson, Hadow, Douglas and the guides Croz and Taugwalder father and son. Only Whymper and the guides Taugwalder will survive the descent.", "text_a": "Maja Berger is staying in the Bavarian Alps to recover her health. She is visited occasionally by her husband but is deeply lonely. Then she encounters Florian, a young doctor, who is mountaineering in the district. They fall in love agree to run away together but before he leaves he wants to climb a particular peak one last time. Having made a successful ascent he is caught in a violent storm on the way down and is killed.", "text_b": "The story revolves around Sonny Wexler, an aging and washed-up veteran film producer, who is burdened with a wife struggling with pill addiction. While Sonny had once produced an Oscar-nominated film during his prime, he now grapples with being a \"has-been\" in a Hollywood industry dominated by a younger generation, exemplified by the studio executive Damon Black and foreign investors.\nAware that his time in the limelight is dwindling and fearing he will be forgotten, Sonny decides to make one last bid for relevance by creating a memorable movie. His opportunity emerges when he comes across a remarkable screenplay from a promising young writer. However, Black interferes with the deal and edges Sonny out, leaving Sonny with just seventy-two hours to secure enough funds to acquire the script himself.\nFacing desperation, Sonny resorts to seeking assistance from the mafia to borrow the necessary $50,000 he needs to make his dream a reality.", "text_a_is_closer": true}
{"anchor_text": "Set in the mid-1960s, the story centers on ten-year-old Harriet Frankovitz, a lonely outcast who lives with her mother and older sister Gwen in a dilapidated New Hampshire motel with cabins shaped like tipis her mother received as part of her divorce settlement. Harriet has a strong desire to escape her dull existence by means of any one of a number of creative ways - a magic carpet she tries to fly off the roof, on board a flying saucer she anxiously awaits in the schoolyard, through a tunnel she has been digging to China, or by attaching helium-filled balloons to a lawn chair. Mrs. Frankovitz is a bitter alcoholic with a propensity for driving on the wrong side of the road, while Gwen has sexual encounters with a series of men in vacant rooms. Terminally ill Leah Schroth is en route to an institution where she plans to admit her intellectually disabled son Ricky when their car breaks down near the motel, and the two stay there while waiting for the vehicle to be repaired. Mrs. Frankovitz is killed in an automobile accident, and Harriet discovers Gwen is her biological mother. The distressed girl and her new friend run away and set up house in an abandoned caboose concealed beneath dense foliage in the woods. When Ricky becomes ill, Harriet is forced to seek medical assistance for him. Once he recovers, his mother sets off with him to complete their interrupted journey, leaving Gwen and Harriet to learn to interact in their new roles of mother and daughter.", "text_a": "Madison and Alex Stewart are twin sisters from Illinois who are whisked away to Atlantis Resort in The Bahamas by their parents for winter break. Initially, the sisters are disappointed that they didn't get to go to Hawaii with their friends, but overcome it by enjoying their newly earned freedom in the form of their own suite, as well as the pristine beaches of the Caribbean.\n \nAlex falls for \"hottie\" Jordan, a worker at the resort. She's not the only one with her eye on Jordan – the spoiled heiress, Brianna Wallace is also in love with him, and plays dirty to get her way. Madison, meanwhile, is being wooed by cute, but brainless, Scott, who in turn is being coached behind the scenes by Griffen, a childhood friend of Madison's with a not-so-subtle crush, to talk to Madison and eventually get her under his thumb.\n The sisters' holiday of fun in the sun is interrupted when Jordan is blamed for allegedly fencing stolen antiquities. Griffen and the twins dodge their meanwhile suspicious parents to find and expose the real culprit, understanding the true meaning of sisterhood along with having a great vacation.", "text_b": "Half Broke Horses is the story of Lily Casey Smith's life. Author Jeannette Walls, the granddaughter of Lily Casey Smith, wrote the book from Lily's perspective.\nAs a child growing up on the frontier in Texas, Lily learns how to break horses. At the age of fifteen, she rode five hundred miles, alone, to get to her job as a teacher in a one-room schoolhouse. Later in her life, Lily runs a vast cattle ranch in Arizona, along with her second husband and their two children. A woman of many talents, Lily earns extra money at various points in her life by playing poker, selling bootleg liquor, and riding in horse races.\nHalf Broke Horses depicts the freedom of rural life, its joys and struggles, and celebrates the courage and spirit of its protagonist, Lily Casey Smith. Walls says the book is “in the vein of an oral history, a retelling of stories handed down by my family through the years, and undertaken with the storyteller’s traditional liberties.”", "text_a_is_closer": false}
{"anchor_text": "The film follows a man, Jack (Jesse Metcalfe), faking insanity in order to save his sister, Lily (Kiele Sanchez), who has been involuntarily institutionalized. The siblings soon find that a mad doctor at the asylum, Dr. Gianetti (Peter Stormare), has been testing an experimental compound, orphium, on the patients that seems to be turning them into flesh-eating zombies; Loomis (Kurt Caceres), another patient, spreads the infection.  The two siblings band together with a terminally paranoid man, Dave (Kevin Sussman), and a helpful nurse, Nancy (Olivia Munn), in the hopes of finding a way out of the asylum.  They are attacked by most of the prisoners and staff, who kill Nancy; while on the 4th floor, they encounter the doctor, who gives Dave an icepick lobotomy, incapacitating him; he attempts to get Jack too, but ends up being infected by Loomis. At the end of the film, as the two siblings are in a police car heading to the asylum to investigate, the officers (Mark Kelly & Sharon Schaffer) accidentally let the patients escape into the outside world. It ends with a panning shot, revealing the city below the asylum's hillside location.\nThe secondary plot focuses on the affair between Charles (Evan Parke) and Heather (Lisa Arturo).", "text_a": "A woman's mistakes come back to haunt her in a terrifying and very literal manner in this mind-bending thriller. Dr. Samantha Goodman (Kate Greenhouse) is a clinical psychiatrist who works with patients at an institution for the criminally insane. Things have not been rosy for Sam lately—she's been violently attacked by one of her patients, her marriage to husband David (Gordon Currie) is in bad shape, and she has an inoperable brain tumor that's growing at an alarming rate.\nSam needs a weekend away from the city, but what David has set up isn't especially relaxing for her—a short holiday at a remote cabin, where David will be editing his latest book with the help of Sam's younger, attractive sister Melody (Iris Graham). As Sam watches sparks begin to fly between her sister and her husband, Harlan Pyne (Aidan Devine) and his friend Adrian (Dov Tiefenbach) break into the cabin and announce their presence by shooting Sam's pet dog.\nHarlan is a convicted sex offender and murderer who was placed under Sam's care in the institution and wasn't happy with the experimental treatment he received; having escaped, he and Adrian have tracked her down and decide to take revenge by forcing Sam, Melody, and David to participate in a series of strange and humiliating games.", "text_b": "Danish miner Svend Viltorft digs up a section of a giant reptile's tail from the frozen grounds in Lapland, where he and other miners are drilling.  The section is flown to the Denmark's Aquarium in Copenhagen, where it is preserved in a cold room for scientific study. But due to careless mishandling, the room is left open and the section begins to thaw, only for scientists to find that it is starting to regenerate.\nProfessor Otto Martens, who is in charge of the aquarium, dubs the reptilian species \"Reptilicus\" (upon a reporter's suggestion) and compares its regeneration abilities to that of other animals like starfish.\nOnce fully regenerated from the tail section, Reptilicus goes on an unstoppable rampage from the Danish countryside to the panic-stricken streets of Copenhagen (including one of its famous landmarks, Langebro Bridge). The monster is finally rendered unconscious by a sedative developed by ingenious scientists and shot into its mouth from a bazooka fired by General Grayson.\nHowever, the film is left open-ended. A final shot shows one of Reptilicus' legs, which had been blown off earlier by the Danish Navy's depth charges, sitting on the sea floor, raising the possibility that it could regenerate into a new Reptilicus.", "text_a_is_closer": true}
{"anchor_text": "Textile company heir James Wayland (Tim Roth) is accused of murdering a prostitute named Elizabeth (Renée Zellweger), whose body was found cut in two. The murder is investigated by tough detective Kennesaw (Michael Rooker) and his less experienced partner Braxton (Chris Penn).\nWayland is a heavy drinker and compulsive liar, prone to memory losses and periods of violence. He is rich enough to access necessary information, however, and he soon learns his interrogators' own dark secrets - Kennesaw had an affair with Elizabeth to get back at his wife (Rosanna Arquette) for cheating on him, while Braxton has gambling debts with a bookie known as \"Mook\" (Ellen Burstyn), who is demanding $20,000 payment.", "text_a": "Conman Raymond Fernandez (Jared Leto) defrauds rich women through personal ads, and meets Martha Beck (Salma Hayek) who joins Raymond in his schemes, posing as his sister.\nThey begin traveling the country, murdering over a dozen women who respond to their ads. \nHomicide detectives Robinson (John Travolta) and Hildebrandt (James Gandolfini) track them down and bring them to justice.", "text_b": "Vince Newman (George Peppard), a hard-nosed Los Angeles cop, is loyal to his partner Garry (Roger Robinson), devoted to his family and far too principled to take a bribe. So when he gets booted from duty after being falsely accused of extortion, he decides to go rogue and keep investigating an organized crime case he was working on. As he digs deeper, he stumbles upon a conspiracy that might extend beyond the local mob scene, perhaps even to the highest reaches of his own department.", "text_a_is_closer": false}
{"anchor_text": "It's the end of the 60s and Bennie Köpke (Tom Schilling) is training to be a police photographer despite wanting to be a film director. He lives with his mother in the prestigious Munich district of Ramersdorf and his swearing in ceremony is coming up in two weeks. At a demonstration, Bennie films rebellious teenagers in plain clothes and falls in love with Luzie (Karoline Herfurth) who lives in an activist commune. Problems arrive when Bennie's younger brother, Freddie (Benno Fürmann) shows up in desperate need of money and a simple solution: they film a pornographic film which Bennie directs.", "text_a": "The young German-Polish Jana does everything possible to give the impression of a straight acting woman. Her good-looking, bourgeois friend David and her pretence of working for a newspaper are attempts to hide her inner conflicts and her true occupation as a social worker in the low-prestige Berlin district of Neukoelln.\nBut there is the young German Turk Nazim, who also tries hard to keep up the appearance of straightness. Night after night he goes out with his friends, dances with girls like Jana and deals with drugs on Hermann Square. Neither his best friend Akin nor his playmates are suspicious.\nSince his nocturnal encounter with a young German man on Sonnenallee it has become more difficult for him to keep up the façade of normal life. This is the beginning of a love triangle that is dangerous for the self-understanding of all parties, because Nazim's new lover is no one else but Janas boy friend David.", "text_b": "17-year-old Jakob lives with his grandfather and father in a small apartment in Vienna. In order to earn some money for his studies, he works as a temporary worker in the slaughterhouse where his father works. Jacob is struggling with an anxiety disorder that makes life increasingly difficult for him. In a sex cam chat, he meets the 26-year-old artist Kristjan. At first, a virtual friendship develops between the two of them, without a real meeting taking place for the time being. Only after a heavy stroke of fate does Jakob gather his courage and make an appointment with Kristjan in his apartment, leading to an extremely unexpected chain of events.", "text_a_is_closer": false}
{"anchor_text": "Alice is enslaved on a 19th-century style plantation in Georgia, owned by Paul Bennet. Attempting to escape, she runs through a vast forest and emerges onto a Georgia highway in 1973. She meets Frank, a truck driver who helps her adjust to the truth of the time period, and that she has been misled her whole life. After reading some books explaining when and how all other plantations ended, and tracking down Rachel, the ex-wife of her \"owner\", she is able to convince Frank about the plantation. Inspired by Pam Grier's character in the film Coffy, she persuades Frank to go back with her, so that she can exact revenge on Bennet and free the rest of the \"domestics\" being held there.", "text_a": "A woman's mistakes come back to haunt her in a terrifying and very literal manner in this mind-bending thriller. Dr. Samantha Goodman (Kate Greenhouse) is a clinical psychiatrist who works with patients at an institution for the criminally insane. Things have not been rosy for Sam lately—she's been violently attacked by one of her patients, her marriage to husband David (Gordon Currie) is in bad shape, and she has an inoperable brain tumor that's growing at an alarming rate.\nSam needs a weekend away from the city, but what David has set up isn't especially relaxing for her—a short holiday at a remote cabin, where David will be editing his latest book with the help of Sam's younger, attractive sister Melody (Iris Graham). As Sam watches sparks begin to fly between her sister and her husband, Harlan Pyne (Aidan Devine) and his friend Adrian (Dov Tiefenbach) break into the cabin and announce their presence by shooting Sam's pet dog.\nHarlan is a convicted sex offender and murderer who was placed under Sam's care in the institution and wasn't happy with the experimental treatment he received; having escaped, he and Adrian have tracked her down and decide to take revenge by forcing Sam, Melody, and David to participate in a series of strange and humiliating games.", "text_b": "In 1943, the US Navy ship USS Eldridge disappears, due to the Philadelphia Experiment.  In the present day (2012), researchers try to recreate the experiment, which has the unintended consequence of making the Eldridge reappear, apparently having traveled through time.  The sole survivor of the original experiment is aboard, and meets up with his now-adult granddaughter.  The Eldridge continues to drift through time and space, trapping others aboard it.  The research company attempts to cover up the incident by trying to kill everyone involved.  A struggle ensues as others try to protect the survivors, and return them to their original times and places.", "text_a_is_closer": false}
{"anchor_text": "Entertainer Harry Bernard is in the Caribbean being pursued by a policeman accompanied by a guide and interpreter who does not wish to end his payment, so allows Harry to get away. Fate gives Harry a chance to escape when a guide nervous about flying lets Harry take his place on a Boeing 314 Clipper travelling through the islands. The passengers comprise five beautiful women and their chaperone, Miss Mullens. One of the girls, Ann, is being pursued romantically by the clipper's pilot, but she is only interested in meeting a singer who she has only heard on the radio.", "text_a": "At 1959, the People's Police notices a strange occurrence: the local demand for optical instruments increases, while the orders from abroad sharply decrease. Several detectives launch an investigation, revealing that a West German criminal named Hasso Teschendorf has been forging documents and using them to illegally obtain the goods, which he sold to the Spanish Army and to customers in Barcelona. After a long hunt, the smuggler is arrested just before he manages to flee to West Berlin.", "text_b": "Conman Raymond Fernandez (Jared Leto) defrauds rich women through personal ads, and meets Martha Beck (Salma Hayek) who joins Raymond in his schemes, posing as his sister.\nThey begin traveling the country, murdering over a dozen women who respond to their ads. \nHomicide detectives Robinson (John Travolta) and Hildebrandt (James Gandolfini) track them down and bring them to justice.", "text_a_is_closer": true}
{"anchor_text": "Set in the city of Prague in 1919, Kafka tells the tale of an insurance clerk who gets involved with an underground group after one of his co-workers is murdered. The underground group, responsible for bombings all over town, attempts to thwart a secret organization that controls the major events in society. He eventually penetrates the secret organization in order to confront them.", "text_a": "Vera witnesses the persecution of ethnic Germans in Yugoslavia, which awakens her ethnic consciousness. Her cosmopolitan friend Alexander is arrested. Vera flirts with the Serbian commander to allow Volksdeutsche to escape to the border. When arrested, she proudly affirms that she helped her countrymen and, in an escape attempt, is shot, to die happy and heroic.", "text_b": "In 1919, after just a few months of communist rule, the Hungarian Republic of Councils was dissolved by a nationalist counter-revolution. Admiral Horthy, leader of the nationalists, assumed power as the Regent of Hungary. Hungarian Red Army soldiers were relentlessly pursued by the secret police and Hungarian Royal Gendarmerie and faced summary execution. One, István Cserzi, has fled to the Great Hungarian Plain and taken refuge on a farm run by two women. Due to their help and that of a childhood friend who is a commandant of the local Gendarmarie, István is relatively safe if he keeps out of sight. However, discovering that the women are slowly poisoning the husband of one of them and his mother, the farm's owners, István must decide whether to denounce them to the authorities at the likely cost of his own life.", "text_a_is_closer": false}
{"anchor_text": "Claudius Bombarnac, a reporter is assigned by the Twentieth Century to cover the travels of the Grand Transasiatic Railway which runs between Uzun Ada, a harbour on the eastern coast of the Caspian Sea, and Peking, China. Accompanying him on this journey is an interesting collection of characters, including one who is trying to beat the round the world record and another who is a stowaway. Claudius hopes one of them will become the hero of his piece, so his story won't be just a boring travelogue. He is not disappointed when a special car guarded by troops is added to the train, said to be carrying the remains of a great Mandarin. The great Mandarin actually turns out to be a large consignment being returned to China from Persia. Unfortunately the train must travel through a large part of China that is controlled by unscrupulous robber-chiefs. Before the journey is over, Claudius finds his hero.", "text_a": "In 1961, Nombeko Mayeki is born a poor black girl in Soweto. She leaves the slums and in a twist of fate – is run over but survives – this puts her into the employ of the engineer who ran her over, as a cleaner in South Africa's secret nuclear weapons facility. Here, her good head for mathematics leads her to cover for her drunken and incompetent employer. Two Mossad agents eventually murder her employer, but she outwits them and escapes to Sweden with a trio of female Chinese con artists, but due to a mix-up, Nombeko ends up in possession of a missing South African atom bomb. In Sweden, she settles into a condemned building living in a bizarre commune including a pair of identical twins (both named Holger), the youngest of which and his girlfriend are die-hard republicans determined to end the Swedish monarchy. Nombeko and her Swedish boyfriend (the older Holger) are determined to hand the bomb over to the Swedish Prime Minister, but no-one will believe them.  Years later, after several attempts to hand over the bomb have failed in absurd circumstances (including the remaining Mossad agent finding and nearly killing them), Holger and his girlfriend kidnap the King and the Prime Minister of Sweden on the spur of the moment from a gala banquet with Chinese President  Hu Jintao at the Royal Palace in Stockholm, and prepare to blow up the bomb (and everything within a 38-mile radius) in order to end the monarchy. Nombeko calms the situation down, saving the King's life, and her own.", "text_b": "Hannes, a truck driver from Germany, is a train timetable enthusiast who dreams of winning the first prize at the International Timetable Contest that is to be held in Inari, Finland. When his boss ruins his plans to travel to Inari, Hannes knocks his boss unconscious and leaves the country. While on his trip to Finland by train, his boss is found dead at his office, making Hannes the prime suspect. During his journey, unaware that he is being pursued, Hannes meets many new people, including the love of his life.", "text_a_is_closer": false}
{"anchor_text": "In the busy wholesale-retail world of London's East End everyone, it seems, has unattainable dreams. Then a small boy – Joe – buys a unicorn, in fact a sickly little goat, with just one twisted horn in the middle of its forehead. This, he has been led to believe by a local tailor, Kandinsky, will bring everyone good fortune.\nThe film has a haunting last image, of Kandinsky carrying the tiny body of the \"unicorn\" to the graveyard, whilst passing in the opposite direction is a Torah-reading Rabbi pushing a horn gramophone, a character that appears in the background several times during the film.", "text_a": "1940 The Great Depression is over and World War II had just begun. King of the con men Fargo Gondorff is released from prison and reassembles his cronies for another con, out to avenge the murder of his lifelong pal and fellow con artist Kid Colors who was kidnapped, beaten, and then shot.\nGondorff's young protege Jake Hooker attempts to pull a scam on wealthy \"Countess Veronique,\" who instead pulls one on him and turns out to be a grifter herself named Veronica.\nComing up with a boxing con, Gondorff's goal is to sting both Lonnegan, the notorious banker and gangster who wants revenge from a previous con, and Gus Macalinski, a wealthy local racketeer. One or both of them is behind Kid Colors' death.\nHooker pretends to be a boxer who is about to throw a big fight. Macalinski is not only hoodwinked into losing hundreds of thousands of dollars, but he is also talked into changing his original wager by Lonnegan. While one gangster takes care of the other, Gondorff and Hooker head for the train station with a bag full of money, tickets out of town and a final twist from Veronica.", "text_b": "After the death of his father, young Anton Wohlfart begins an apprenticeship in the office of the merchant T. O. Schröter in Breslau. Anton quickly succeeds through honest and diligent work, achieving a proper bourgeois existence. He has a variety of experiences with the Schröter family and also with the noble family of the Rothsattels. He later becomes involved with the liquidation of the estate of the Rothsattel family, an obvious symbol of the decline of the nobility and of its clash with emergent capitalist forces.\nAnton has repeated interactions with two other young men, the Jew Veitel Itzig, whom he had known already in his home town, Ostrava, and a young nobleman, Herr von Fink, who is a co-worker in the Schröter firm.", "text_a_is_closer": false}
{"anchor_text": "Xavier Lombard is a Parisian private detective based in London. His best friend is Nathalie, a high-class call girl. He gets a telephone call from an old friend in the Paris police department, now a businessman whose brother-in-law is missing. The missing man's parents hire Xavier over their daughter's objections, and he quickly finds himself caught up in the underworld of child sex slavery. He guesses that the lost son is dead and shifts his focus to finding and breaking this lucrative business of child trafficking. He gets a reluctant Nathalie to hunt \"the Austrian\", the shadowy head of the pedophile ring. Violence erupts quickly, and Xavier soon has little more to lose.", "text_a": "Ezekiel Mannings, a wealthy businessman and notorious crime lord who is under house arrest in New York, seeks the elimination of Nick Murch, the only witness who can tie him to a murder. Murch is sequestered in a heavily guarded safe room in London in order to give evidence against Mannings over a video link to the United States. An unnamed female courier and former special ops soldier delivers a package to the safe room, unaware that the package contains a cyanide gas weapon intended to kill Nick. She rescues Nick from the attack and discovers that his protection detail has been compromised. The two are trapped in an underground parking garage full of heavily armed men who have been sent to finish the job. The assassins have an hour to find and kill Nick and the courier before police backup arrives, but she kills all of them in a brutal battle and transports a gravely wounded Nick to a hospital. He survives to testify against Mannings.", "text_b": "The narrative revolves around Noredin (Fares Fares), an enigmatic and rugged detective renowned for his chain-smoking habit. Tasked with a investigation, he delves into the unsettling murder case of Lalena, a pop star entwined in the world of politics as Hatem Shafiq's (based on Hisham Talaat Moustafa) mistress. The grim discovery of Lalena's lifeless body, her throat brutally slit, occurs within the confines of the eponymous Nile Hilton hotel.\nThe case takes an intriguing turn as the sole witness to the gruesome crime emerges – a Sudanese maid by the name of Salwa (Mari Malek). Shafiq denies culpability for the murder of Lalena, who, it turns out, collaborated with a sleazy pimp named Nagy (Hichem Yacoubi) to capture compromising images of her clients (including Shafiq) to be used as blackmail. The film also revealed that Shafiq had another mysterious guy (Slimane Dazi) kill Lalena.", "text_a_is_closer": false}
{"anchor_text": "The film begins with an unnamed man arriving by train to Helsinki. After falling asleep in Kaisaniemi Park, he is mugged and beaten by hoodlums and is left with severe head injuries, losing consciousness. He awakes and wanders back to the train station and collapses in its toilet. He awakes the second time in a hospital and finds that he has lost his memory. He starts his life from scratch, living in a shipping container, finding clothes with help from the Salvation Army and making friends with his poor neighbours.", "text_a": "Ben (Colin Firth) awakens from a coma to discover his wife has been killed in a car accident. A few weeks later, Ben is out of the hospital and, attempting to start a new life, he moves home and is befriended by a beautiful young neighbour Charlotte (Mena Suvari). Haunted by visions of his dead wife, Ben starts to lose his grip on reality.", "text_b": "A man wakes up in a small concrete space bleeding from the abdomen. He can barely move and has no recollection of why or how he came to be there. Crawling forward he eventually meets a woman and they try to piece together their past lives.", "text_a_is_closer": false}
{"anchor_text": "In the Emilia province of Italy, out of solidarity with the workers fired from another failed company, the workers occupy the factory of self-made industrialist Annibale Doberdò. In dealing with the situation, he starts negotiations. An employee, the beautiful and fiery Irene, nicknamed Califfa, whose worker-husband was killed during a demonstration, meets with Doberdò. He wants to induce the strikers back to work and they show uncertainty between the directives of their union and the incitements to violence by extremists. Irene becomes Doberdò's lover and asks the workers to listen to the industrialist's proposals for renewal of working terms and worker participation in the factory management. The riots, however, continue. The industrialist's stance is badly received by other employers. While he returns from yet another meeting with his lover, Doberdò is killed by assassins.", "text_a": "Drama in the house Puhlmann: Grandpa Friedrich has burned his kitchen - almost! With his 78 years, he must have in a nursing home? No, Grandpa Friedrich can not get out of his old apartment. Not for nothing he has hoarded his six-figure nest-egg in ice cream box. With this money, he starts one last great adventure and founds a municipality with his old pal, the wacker proletarian metalworker Hannes Majowski. As in the past, but very different. But then Lotte enters the stage, the granddaughter of Hannes, who wrote a seminar paper on the Kommune 1...", "text_b": "A wealthy heiress falls in love with a middle-class worker of romantically quaint disposition.  In part one, the woman's father hires a hypnotist to program his daughter to instead choose a more appropriate suitor selected by him.  When that plot is unraveled, the couple secretly marry and flee into the abandoned countryside and attempt to live off the land.  After being driven back into the city, the couple live a modest middle-class lifestyle until their money runs out.  At that point, they move to the \"underneath\" area of London to toil in physical labour as lower-class workers.  Finally, their issues are resolved through the machinations of her spurned would-be suitor, and they resume a middle-class lifestyle.", "text_a_is_closer": false}
{"anchor_text": "Aviator Gloria James Jessup went missing twenty years ago. Tarzan and Jane hear news of a man back in the United States who is about to be sentenced to life imprisonment; the only way he can be cleared is for Jessup's testimony. Tarzan secretly leaves for the hidden valley where Jessup has secretly been living for almost two decades and brings her back to testify.\nJessup looks decades younger than her actual age and this prompts a pair of men to ponder the rumor of a magic Fountain of Youth and try to find it after she returns from testifying and heads back there.", "text_a": "The parents of a young boy think Bomba is just an imaginary friend of their son's. Luckily, they learn differently after the boy is kidnapped by a pair of crooked jungle guides who are searching for a lost city's treasure. Bomba [Johnny Sheffield] rescues the boy, battles a croc, and with the help of an erupting volcano and a python, finishes off the bad guys.", "text_b": "Aloma and Prince Tanoa,  are promised by the islanders to wed from their childhood, though the two despise each other and fight.  Tanoa is sent to the United States for an education and does not return for 15 years after the death of his father.  Once crowned, Tanoa's treacherous cousin Revo who has plotted to rule in place of Tanoa since childhood, sees his chance by arming himself and his band with rifles and a light machine gun.", "text_a_is_closer": true}
{"anchor_text": "Following the death of her archeologist husband, Ruth Matthews moves her family back to their house in a quiet suburb, hoping to put the past behind them. While her son Michael is able to adapt, her young daughter Sally, is apparently traumatized by the experience and starts displaying unusual behavior, including building an elaborate tower from playing cards and photographs. Ruth is later court mandated to see Jake Beerlander, an expert in child autism, to help Sally.", "text_a": "In 1941, the Polish town Kielce is occupied by the Nazis. The main character, before being sent to a concentration camp, gives her daughter to a Polish family whose child has recently died. When the war has passed, the former prisoner returns to his hometown and wants his daughter returned, but she has grown up not knowing who her real parents were. Internal contradictions and deep spiritual experiences put the heroes in a cruel situation of choice.", "text_b": "When Shirin moves into a new house with her new boyfriend Fredrik and his five-year-old son Lucas, it seems like a good idea to live together as a family. Lucas is still struggling with the recent death of his mother, and so Shirin is not surprised by his question about whether dead people can actually come back. However, when he talks about his new friend next door, she becomes suspicious, because the other half of the house has been empty for years! Little by little, she discovers that the house holds a terrible secret and that something evil is after Lucas...", "text_a_is_closer": false}
{"anchor_text": "Armand de la Verne, a lieutenant in the French cavalry and a notorious seducer, undertakes a bet that he will \"obtain the favours\" of a woman selected secretly by lot, before his company departs for its summer manoeuvres in a month's time. His target turns out to be Marie-Louise Rivière, a Parisian divorcée who runs a milliner's shop, and who is also being courted by the serious and respectable Victor Duverger. Marie Louise's growing attraction towards Armand is tempered by her discoveries about his reputation, while Armand's calculated strategy becomes undermined by his genuine emotions. A subplot follows the parallel but simpler courtship of Armand's friend and fellow officer Félix and Lucie, the young daughter of a photographer.", "text_a": "Betty, a young alcoholic woman, is caught cold while cheating on her bourgeois husband.  Wasting no time, he and his family arrange a quick divorce settlement, ousting her from home and keeping her away from the two children the couple have.  One night she ends up in a restaurant called Le Trou (The Hole), where she meets Laure, an older woman, an alcoholic herself.  Laure decides to take care of Betty after hearing the heart-breaking stories of her being a victim of her husband's rich and ruthless high society family.  Betty receives care and friendship from Laure, who's in a relationship with Mario, the restaurant's owner.  Betty's envy toward Laure, especially regarding her relationship with Mario, grows each day and eventually drives Betty to contrive the means to conquer her new friend's lover.  Laure realizes she has made a mistake by trusting Betty, and things soon begin to fall apart between them.  Betty's true colors are now visible and she sees her life at a point of no return, as she has selfishly stomped on the last chance she had of being a better person.", "text_b": "In the lower echelons of Parisian society in the 1860s, Thérèse Raquin is a beautiful, sexually repressed young woman trapped in a loveless marriage to her sickly cousin, Camille, who she was forced to marry by her domineering aunt, Madame Raquin.\nThérèse spends her days confined behind the counter of a small shop and her evenings watching Madame Raquin play dominoes with an eclectic group of acquaintances. After she meets her husband's alluring friend Laurent LeClaire, the two embark on an illicit affair that leads to tragic consequences.\nDuring an outing on the lake with Laurent and Therese, Camille is beaten to death by Laurent and subsequently drowns. Madame Raquin finds it difficult to come to terms with her son's death and is soon incapacitated by a stroke, but overhears Laurent and Therese speaking about what they did. With great effort, she alerts one of their friends, who informs the authorities.\nTo escape being sentenced for the murder, Laurent and Therese choose to take their own lives. They go down to the river and share one final kiss after drinking poison mixed with champagne, and thus they die in front of Madame Raquin.", "text_a_is_closer": true}
{"anchor_text": "A German businessmen is sent to Stockholm by his boss to secure an important contract, in the face of foreign competition. He discovers that the intended client has gone sailing round the Swedish islands and follows him. He becomes mixed up with a mysterious young woman named Maibritt, who eventually turns out to be the daughter of his intended client.", "text_a": "Scant days before her wedding to Vittorio, Nelly has a change of heart and runs away. As Vittorio pursues her through Caracas, she turns for help first to Alex, a previous employer, and then to Martin, a middle-aged French man she meets by chance. Martin drives her to the airport, where she gets a plane ticket to Paris. Returning by boat to his peaceful lonely life on an island off the coast, Martin is surprised and dismayed to find that Nelly has made her way there ahead of him. When he tries to return her to the mainland she sabotages the boat, causing it to sink. Marooned upon the island, Martin is forced to adapt to his new neighbor, who is determined to stay.", "text_b": "In a small, provincial town the clumsy young Peter Abendrot dreams of being the \"cock of the roost\" and enjoying success amongst the woman of the town. However, he is scorned until an unexpected inheritance from an American uncle suddenly makes him very wealthy. The mother's of the town now all want their daughters to marry him, but he decides to head for the capital Berlin, believing he can now set his sights higher. In the capital he is snared by Jutta, the daughter of a banker, whose father desires to get his hands on the young man's wealth.", "text_a_is_closer": false}
{"anchor_text": "Ted Scott (John Payne) is a band pianist whose publicity manager decides that, for good press, the band should adopt a foreign refugee. The band goes to Ellis Island to meet the girl and soon discovers that the refugee isn't a 10-year-old child, but a young woman, Karen Benson (Sonja Henie). The surprise comes right before the band is to travel to Sun Valley, Idaho, for a Christmas event. While on the ski slopes Ted soon falls for Karen's inventive schemes to win the heart of her new sponsor, much to the chagrin of his girlfriend, Vivian Dawn (Lynn Bari), a soloist with the band. Vivian promptly quits the band out of jealousy, and Karen stages an elaborate ice show as a substitute.", "text_a": "The film is set at a United States Army base in Kentucky at the end of 1944, during World War II. \nThe protagonists are First Sergeant Vic Puccinelli and Private First Class Alvin Korwin, who were partners in a nightclub song-and-dance act before joining the Army.\nPuccinelli wants to be transferred from his dull job to active duty overseas, but is refused transfer and is to be promoted to Warrant Officer. Korwin wants a pass to see his wife and new baby. In addition, they have to rehearse for the base talent show and avoid the wrath of Alvin's platoon sergeant, Sergeant McVey.\nAlong the way they both sing a few songs, and they do an impression of Bing Crosby and Barry Fitzgerald by recreating a scene from Going My Way (1944) for the talent show. Further complications include a Post Exchange worker who is pregnant, a company commander who gets all his information from his wife, a scheming supply sergeant, and a defective Coca-Cola machine.", "text_b": "Reisiger travels over the world, in search of news stories.  He meets and marries Franziska, after her pregnancy, but continues to leave her.  One colleague, dying, tells him to go home, and he returns.  When World War II breaks out, he  must leave again for war, and Franziska waits for him.", "text_a_is_closer": true}
{"anchor_text": "Dolph wakes up early in the morning in his suburban home to find that his dog is missing. He is in denial that he has lost his job and shows up to his office to work every day and pretends to do his work. Dolph's need to live in a world of denial about all the areas in his life that are obviously not working is found throughout his life. A palm tree in his backyard transforms into a pine tree. It's raining inside Dolph's office even though none of his co-workers seem to notice it or care that they're being soaked. To put his life back together, he goes in search of his dog.", "text_a": "British newlywed Regina Lambert lives in Paris with her husband Charles.  She returns home following a short vacation, determined to divorce Charles only to discover their apartment has been stripped bare and that her husband has been murdered. The French police are in her apartment.  Charles had liquidated their possessions for $1.8M and the money is missing.\nRegina is soon reunited with a mysterious stranger Joshua (Mark Wahlberg) she met on her holiday. He helps her piece together the truth about the deceased Charlie and deal with three menacing people who are now following her.", "text_b": "Chip Gutchell, an IT specialist and recovering alcoholic, develops a compulsive behavior after a routine rectal exam, where anything he inserts into his anus mysteriously disappears. His obsession escalates, leading to the disappearance of small objects, pets, and eventually people. Detective Russel Fox becomes suspicious of Chip's involvement and investigates the mysterious disappearances, while Chip struggles to keep his secret hidden. The tension builds as the detective gets closer to the truth, culminating in a climactic confrontation that reveals the extent of Chip's compulsion.", "text_a_is_closer": false}
{"anchor_text": "Colonel Anacleto Punzone (Banfi) is a military doctor with expertise in organ transplantation. He has a small penis, leading to a frustrated sex life with his wife Giovanna (Malisa Longo). Furthermore, his penis size forces him to dodge sexual advances from an attractive colleague, Prof. Eva Russell (Cassini). Colonel now contemplates on the radical solution of penis transplantation, finding a potential donor in dim-witted and well-endowed Private Arturo Mazzancolla (Alvaro Vitali). During Prof. Russell's visits to the military hospital, Colonel realises that other men, including handsome Lieutenant Lancetti (Bruno Minniti) are interested in her and he feels that the operation is even more urgent; although he is not confident as it may result in some complications (like permanent erection or no erection).", "text_a": "The Father, an aging, half blind man who carries the title of colonel within the village, has made a promise to bury the recently deceased former doctor in spite of the consensus within Macondo that he should be left to rot within the corner house where he had lived in complete social isolation for the past decade.  The daughter, Isabel, is obliged to accompany her father out of respect for traditional values while knowing she and her son will be doomed to face the wrath of her neighbors in Macondo.  The narrative of the grandson, on the other hand, is more preoccupied with the mystery and wonder of death.\nAs with many of his stories, such as Love in the Time of Cholera and Chronicle of a Death Foretold,  García Márquez introduces a dramatic scene to begin his narrative and then moves backward, rehashing the past that will lead up to the ultimate conclusion.  It is discovered within the narrative that the center of all the conflict (the deceased) is a doctor who came to Macondo with a mysterious past and no clear name.  The man's only saving grace is a letter of recommendation from the Colonel Aureliano Buendia, one of the main characters of the later  One Hundred Years of Solitude.  It is this letter that leads the stranger to the family that serves collectively as narrator to the drama that unfolds.", "text_b": "In pre-revolutionary France, the canine Marquis de Sade sits in jail working on his writing and having conversations with his penis which has a face and is named Colin. When Colin is not whining about his need for stimulation and espousing his impulsive philosophies, he is \"telling stories\" that make up the Marquis' work (some of which is illustrated via clay animation).\nThe Marquis was imprisoned for allegedly defecating on a cross, however he is also accused of raping and impregnating the bovine Justine. The latter is a plot by the camel-headed priest Don Pompero and the cocky Gaetan De Preaubois try to keep secret the fact that Justine's rapist was actually the King of France.\nMeanwhile, the revolutionaries prepare to stage a coup and depose the king, under the lead of Juliette de Titane, an equine noble. Several of the inmates are also political prisoners leading to several failed escape attempts which land the inmates in the Bastille dungeon. They are eventually freed, however, by the revolutionaries.\nColin eventually falls in love with Juliette and runs away with her to continue the revolution, leaving the Marquis to continue his writing and to muse about his life in peace.", "text_a_is_closer": false}
{"anchor_text": "Federal agent Rigby (Robert Taylor) travels to Los Trancos on the island of Carlotta (somewhere off the coast of Central America) to break up a war-surplus aircraft engine racket and finds himself tempted by corruption, namely Elizabeth Hintten (Ava Gardner), a café singer married to Tug Hintten (John Hodiak), a drunken ex-pilot.\nCarwood (Vincent Price) is the brains of the outfit, aided and abetted by J.J. Bealer (Charles Laughton) and Hintten. Bealer is a waterfront\ninformant who switches sides daily ;depending on which way the wind blows.\nAware he is dying of consumption, Tugwell gives Rigby and Elizabeth permission to find happiness together after he is gone.", "text_a": "Mordecai C. Jones (Scott) – a self-styled \"M.B.S., C.S., D.D. –  Master of Back-Stabbing, Cork-Screwing and Dirty-Dealing!\" – is a drifting confidence trickster who makes his living defrauding people in the Southern United States using tricks such as rigged punchboards, playing cards, and found wallets. He befriends a young man named Curley (Sarrazin), a deserter from the United States Army, and the two form a team to make money. In their escapades, they wreck a town during a hair-raising chase in their stolen car, steal a truck loaded with moonshine whiskey that they sell, break out of a sheriff's office, and discover a riverboat brothel. In the ending scene, Mordecai explains how he sees himself.", "text_b": "Scant days before her wedding to Vittorio, Nelly has a change of heart and runs away. As Vittorio pursues her through Caracas, she turns for help first to Alex, a previous employer, and then to Martin, a middle-aged French man she meets by chance. Martin drives her to the airport, where she gets a plane ticket to Paris. Returning by boat to his peaceful lonely life on an island off the coast, Martin is surprised and dismayed to find that Nelly has made her way there ahead of him. When he tries to return her to the mainland she sabotages the boat, causing it to sink. Marooned upon the island, Martin is forced to adapt to his new neighbor, who is determined to stay.", "text_a_is_closer": true}
{"anchor_text": "The film follows the Artinian extended family with deafness through three generations over a year and a half, focusing on two brothers — Peter Artinian who is Deaf and Chris Artinian, who is hearing — and their wives and children. Chris and Mari Artinian (who is a Child of Deaf Adult) discover that one of their newborn twins is deaf.  They begin to research the cochlear implant and its advantages and disadvantages. Concurrently Heather, Peter and Nita's oldest child, starts asking for an implant as well. The brothers, along with grandparents on both sides, become embroiled in a bitter argument over the importance of deafness, the best form of education for their children and the controversy of cochlear implants for young children. Peter and his wife Nita fear losing a child to the \"hearing world\" and her potential abandonment of Deaf culture.  \nThey were pleased with Maryland and decided to move there and forget the implant. \nChris and Mari chose to have cochlear implant surgery performed on their infant, Peter.", "text_a": "The film begins by detailing the troubled lives of the two brothers; each is experiencing a mid life crisis. With four young children, Uwe and his wife Petra find their obligations overburdening, having little compassion for the other's problems and constantly bickering. Uwe leaves for work after a particularly stressful morning, during which he once again argues with his wife; while at work as a real estate agent, his wife packs up most of their belongings and moves out. Uwe finds a note when he comes home and is immediately distressed to tears.\nMeanwhile, his brother Gustav faces his own problems; though an enthusiast for Zen Buddhism, and outwardly more composed than his brother, Gustav's burdens are internal; he is afraid of making mistakes and also afraid of fear itself. Gustav plans a trip to a monastery in Monzen (far away from Tokyo) in order to find himself. Uwe, both greatly distressed and drunk, asks his brother to take him along. After much hesitation, Gustav agrees to buy his brother a ticket.", "text_b": "Gary (not his real name, which is never revealed) is a hustler walking through the streets of New York City, looking for business. On the way, he saves Kid Joey, a young deaf transvestite who just arrived in New York, from a group of gay bashers, but he regrets it afterwards because Kid Joey becomes infatuated with Gary and follows him everywhere. Gary introduces him to his friends: Valentino, a former porn star, and Mary Carmen, a Mexican young woman who works as a doughnut shop waitress and is in love with Valentino, with whom she has been living for some time. Together they form a bohemian family, which includes Veronica, a still-active porn star, and Nat, a tattoo artist. Gary is also in love with Valentino, who is dying of AIDS. Through the stages of the disease, Mary Carmen and Gary argue over what kind of care he should be receiving, and who is going to supply that care. As Valentino draws near death, Mary Carmen finds out she is carrying Valentino's baby. The three take stock of themselves and their relationships with one another.", "text_a_is_closer": false}
{"anchor_text": "Josh (Jonathan Rhys Meyers) is a high school boy who lives with his adoptive parents and is involved in little crimes with his friends, including young lesbian Bella (Fairuza Balk). His elder brother Walter (Matthew Modine) suddenly comes back home after leaving home ten years prior when he was 18 and not being heard of all those years. Walter starts to involve Josh in various new criminal activities, including robbery.", "text_a": "Conman Raymond Fernandez (Jared Leto) defrauds rich women through personal ads, and meets Martha Beck (Salma Hayek) who joins Raymond in his schemes, posing as his sister.\nThey begin traveling the country, murdering over a dozen women who respond to their ads. \nHomicide detectives Robinson (John Travolta) and Hildebrandt (James Gandolfini) track them down and bring them to justice.", "text_b": "Heather Lofton is nine years old. She comes from a very rich family, but somehow she's not so lucky; in fact, her stepmother can't stand her. Heather is forced to escape away from home, searching for her real mother. The woman Heather has been put in the care of hires a bounty hunter to find her. But in the process, she frames him, and he becomes wanted for kidnapping her.", "text_a_is_closer": true}
{"anchor_text": "The morals and customs of the \"native peoples\" of Upper Austria are described by a team of anthropologists from Sub-Saharan Africa in the style of European and American anthropologists in the non-western world.  While making the film, they discover new cultural phenomena.  Wippersberg turns around the research methodology of Western anthropologists of performing ethnologic studies, and then popularising them by means of a documentary film.\nThe name of the film derives from the discovery that the researchers made, that the churches were vacated, but the locals instead tend to gather in large tents, and drink a yellowish fluid by the litre, while primarily eating chicken and then engaging in a chicken dance.  The researchers come to the conclusion that the chicken has taken the religious-sacrificial role of the lamb.", "text_a": "Based partly on the Milirrpum v Nabalco Pty Ltd (\"Gove land rights\") case about Indigenous land rights on the Gove Peninsula in Arnhem Land, Northern Territory, it was a mix of fact and fiction. The ant mythology was claimed as Herzog's own, but some First Nations peoples did consider the green ant as a totem animal that created the world and humans. Wandjuk Marika noted that the ant Dreaming belief existed in a clan that lived near Oenpelli in the Northern Territory.\nThe film is set in the Australian outback and is about a land feud between a mining company called Ayers (based on Nabalco) and the local Aboriginal people. The Aboriginal people claim that an area the mining company wishes to work on is the place where green ants dream, and that disturbing them will destroy humanity.", "text_b": "In contrast to Buñuel's story, Savages starts when a tribe of primitive \"mudpeople\" performing a sacrifice encounter a croquet ball, rolling through their forest. Following it, they find themselves on a vast, deserted Westchester estate in the 1930s.\nEntering, they begin to become civilized and assume the stereotypical roles and dress of people at a weekend party. There follows an allegory of upper-class behavior. At last, they begin to devolve toward their original status, and after a battle at croquet, they disappear into the woods.", "text_a_is_closer": false}
{"anchor_text": "Nami, a Bōsōzoku leader, kills a high-ranking member of a yakuza organization, due to a turf war and is sent to prison. After serving three years, she finds a home living with her uncle at a pool hall. After meeting a pimp named Ryuji, she acquires a job as a hostess in Ginza, where she soon becomes very popular. However, her criminal past is not easily left behind. Further complicating matters is a local yakuza named Owada, who attempts to take control of the bar and kills Ryuji's sworn brother. Defending her uncle's business and seeking revenge, Nami goes after Owada.", "text_a": "Five young men have lost their ideals during the Nazi occupation. They then decided to make a living by stealing. After they have been caught and convicted they decided to become a legitimate crime organisation. In the process they get themselves in a lot of trouble including getting unwittingly involved in terrorism activities .", "text_b": "The story revolves around Michelle, an assassin who navigates the challenges of battling DNA Hackers, individuals who utilize their skills to gain unauthorized access to people's bodies with fatal outcomes. Alongside her personal struggles with past demons, Michelle also bears the responsibility of keeping her younger brother, Jackie, from falling prey to trouble. Unfortunately, Jackie becomes involved in a robbery, propelling him into a dark world of underground trades that involves DNA Hackers, Loan Sharks, and Gang Fights. Despite Michelle's efforts to keep him away from such vices, Jackie's desire for respect leads him deeper into the dangerous world. Michelle, on the other hand, has always desired a peaceful existence away from the city. As the siblings face multiple challenges, including gunfights, they must navigate their way through an immoral world while holding on to the hope that love can conquer all and that family bonds are unbreakable.", "text_a_is_closer": false}
{"anchor_text": "Sara is a teenager who lives with her family, who are Jehovah's Witnesses. The family's devout image is questioned when the parents divorce as a consequence of the father's infidelity. One night at a party Sara meets Teis, an older boy who takes an interest in her. Teis is not a Witness, and their relationship is rejected by her father, but Sara falls in love and begins to doubt her faith. Facing ostracism from her faith and family, Sara must make the toughest choice of her young life.", "text_a": "In 1931 in Paris, France, Anaïs Nin is in a stable relationship with her husband Hugo, but longs for more out of life. When Nin first meets Henry Miller, he is working on his first novel. Nin is drawn to Miller and his wife June, as well as their bohemian lifestyle. Nin becomes involved in the couple's tormented relationship, having an affair with Miller and also pursuing June. Ultimately, Nin helps Miller to publish his novel Tropic of Cancer, but catalyzes the Millers' separation, while she returns to Hugo.", "text_b": "Leading chemist Hans Schramm is betrothed to Hanna, but falls in love with her younger sister Franka. The two attempt to repress their feelings, but eventually begin an affair. When Hans is extorted by a group of West German agents, who demand to know about his secret work, he is gripped by panic and decides the only way out is to flee to the West. Franka discovers his plans and informs the Stasi. Hans perceives it as betrayal at first, but after all ends well, he realizes she only wanted the best for him.", "text_a_is_closer": true}
{"anchor_text": "When Los Angeles Police Department officers kill a young bank robber after a brutal bank heist, the slain criminal's father, mob boss Vincent Sloan, unleashes a blood bath on the police force.  One by one, Detective Ray Morgan's partners are gunned down, but when his family is murdered, Morgan has nothing left to live for - except revenge.  Becoming an unstoppable one man army, Morgan goes on the ultimate hunt for justice.  At the end, Morgan gets his revenge. He kills Sloan with an exploding barrel.", "text_a": "With his two best friends, Jonas Maldonado, the son of a slain NYPD officer, joins the police academy. After graduating, he's taken under the wing of his father's former partner, Captain Joe Sarcone, who invites him to join the Street Vice Crime Task Force. Under Sarcone's tutelage, he becomes part of a rogue task force that consists of dirty cops. After he learns from the District Attorney's office that his father was murdered by Sarcone after turning state's evidence, Maldonado frames Sarcone for a theft from powerful mob boss Gabriel Baez. Baez orders Maldonado to kill one of his friends as a sign of loyalty, which he reluctantly does. With Baez's help, Maldonado then kills the dirty cops responsible for his father's death. At the end, the Drug Enforcement Agency approaches Maldonado, urges him not to take Sarcone's place as Baez's right-hand man, and Maldonado ponders whether to go straight or not.", "text_b": "An elaborate bank robbery takes place and the gangsters succeed although the FBI had been warned. The bank president dies of a heart attack. Jerry Cotton, who is considered accountable for this major failure, loses his badge over this. Being the man he is, Cotton doesn't let the evil-doers forget that he has unfinished business with them. He catches even the last one although he must jump onto a flying helicopter in order to get him.", "text_a_is_closer": false}
